
var data = {
                    "a1":["あ","安","源于“安”的草体，发音接近。","aishiteru","あいしてる","愛してる","我爱你"],
                    "i1":["い","以","源于“以”的草体，发音接近。","aitai","あいたい","会いたい","想见你"],
                   "u1":["う","宇","源于“宇”的草体，发音接近。","uchuu","うちゅう","宇宙","宇宙"],
                   "e1":["え","诶","日剧里女生常常发出的“诶？！”就是这个音啦。","emoji","えもじ","絵文字","颜文字"],
                   "o1":["お","我","和“我”的写法、发音相近。","oishii","おいしい","美味しい","好吃！好吃好吃！"],

                   "ka1":["か","加","把加字的口变成一点就是か了，发音也非常相近","kawaii","かわいい","可愛い","可爱！"], 
                   "ki1":["き","起","取起字的左半部，发音十分相近。","tenki","てんき","天気","天气"],
                   "ku1":["く","><","哭泣小人的右眼，哭哭哭，就是く。","kuma","","くま","熊(轻松熊叫Rillakuma哦！)"],
                   "ke1":["け","计","源于“计”的草体！","keikaku","けいかく","計画","计划，谋划，规划"],
                   "ko1":["こ","口","口字快写，就是こ啦。","kokoro","こころ","心","❤️"],

                    "sa1":["さ","杀","与“杀”字形、发音相近。","sakura","さくら","桜","樱花"],
                   "shi1":["し","之","从“之”到し，字形与发音都很相似。","sushi","すし","寿司",""],
                   "su1":["す","寺","是不是长得很像！","suki","すき","好き","喜欢"],
                   "se1":["せ","世","来自“世”字的草书，日语中也有“世界”这个词哦。","sekai","せかい","世界","世界"],
                   "so1":["そ","曾","取自“曾”的上部，因为是我的姓氏所以很快记住了w（喂）可以联想“缩”字，取左边的绞丝旁，字形扭曲，很有“犹豫不决想要退缩”的意境，没错，就是そ这个胆小鬼w","uso","うそ","嘘","谎言，说谎"],

                    "ta1":["た","太","发音、字形和“太”字都非常相近","tatami","たたみ","畳","榻榻米就来源于这个词哦"],
                   "chi1":["ち","奇","源于“知”字，但和“奇”联系起来更易记喔！发音和字形都非常相似。","konnichiha","こんにちは","今日は","(白天见面)你好"],
                   "tsu1":["つ","川","源于“川”字，变化较大，但想想，四川有那么多好初(tsu)的美食，很想去四川吃好つ的东西呢！","himitsu","ひみつ","秘密",""],
                   "te1":["て","天","源于“天”字，草写“天”字就是て啦。てんき，天气，发音和中文非常相似。","tenshi","てんし","天使",""],
                   "to1":["と","托","取“托”字的右半部分来看。と字，就像一双胖胖的手小心翼翼地托着一支蜡烛，生怕蜡烛掉下。","tomodachi","ともだち","友達","朋友"],

                    "na1":["な","奈","日本知名女模特小松菜奈常被称为nana。著名漫画家矢泽爱的作品《NANA》讲的也是两个都叫なな(娜娜与奈奈)的的女生相遇的故事，看完这部作品相信你对な字的了解会更深w。","natsu","なつ","夏","夏天"], 
                   "ni1":["に","倪","一个潦草的“倪”字就变成了に啦！\n日语中的数字2，就读做ni。一，二，三。yichi，ni，san。","nihon","にほん","日本","日本"],
                   "nu1":["ぬ","奴","恭喜你遇到了最简单的一个音节！\n和“奴”字的发音和字形一模一样。好了接着看下一个~","inu","","いぬ","狗狗"],
                   "ne1":["ね","祢","祢字和“你”很相似。\n观察字形，这个字长得十分调皮：物体从左边自由落体，又被抛出一道抛物线，就像日本小女生嗲嗲的“捏————！!”撒娇的口气一般。","neko","","ねこ","猫猫"],
                   "no1":["の","乃","乃，在古文里表示判断；の字词义与“的”相似，二者都和判断相关。\n告诉我，你の名字是！！","kiminonamae","きみのなまえ","君の名前","《你的名字》"],
                                
                   "ha1":["は","波","动感光波————！!\n哈——————！！！！\n（咦走错片场了）","haru","はる","春","春天"], 
                   "hi1":["ひ",".‿.","颜文字小人，偷偷发出了“嘻嘻嘻嘻”的笑声：\n“hihihihihihihihihi”","himawari","","ひまわり","向日葵"],
                   "fu1":["ふ","否","取“否”字的上部，上齿抵在下唇上，准备发出“否”字来拒绝：\n“Fu——————”","fuben","ふべん","不便","不便"],
                   "he1":["へ","へ","ヘ(￣ω￣ヘ)颜文字小人奸诈地举起双手准备恶作剧，发出了“嘿嘿嘿”的笑声！","heya","へや","部屋","房间，屋子"],
                   "ho1":["ほ","活","和活字字形、发音都很像。\n新海诚有一部作品叫\n【星(hoshi)を追う子ども】\n（追逐繁星的孩子）","hoshi","ほし","星",""],

                    "ma1":["ま","抹","ま字是一块抹布！","majide","","まじで","真的吗？"],
                   "mi1":["み","美","源于“美”字，发音相近","mimi","みみ","耳","耳朵"],
                   "mu1":["む","木","む字是一只小树精，身体弯弯曲曲，翘起树根到地面上寻找水分","muri","むり","無理","不行，不可能"],
                   "me1":["め","目","小酒窝长睫毛「め」，\n是你最美的记号~","ame","あめ","雨",""],
                   "mo1":["も","毛","和毛字非常相似。\n在日语里もも是桃子的意思，桃子的表面有一层小绒毛，超级可爱w，所以叫もも噢（开始胡说八道）","momo","もも","桃",""],
  
                    "ya1":["や","丫","远处响起了“ya!————”的叫声，\n原来是拿着“丫”形弹弓的小男孩的恶作剧！","yasumi","やすみ","休み","休息"],
                   "yu1":["ゆ","由","来自“由”字的草书。日语里“理由”就读作“ri yu”\n在这里悄悄安利一部运动动画《Yuri on Ice》，译作《冰上的尤里》，很好看w","yuki","ゆき","雪",""],
                   "yo1":["よ","与","和“与”字发音和字形都很相近！","hanayome","はなよめ","花嫁","新娘"],

                    "ra1":["ら","良","到处都有小鹿的奈良县就读作なら(nara)哦。","rakugaki","らくがき","落書き","涂鸦"], 
                   "ri1":["り","利","利的右边，所以也读ri！","ringo","","りんご","苹果"],
                   "ru1":["る","路","路字的右边，因为长路漫漫，带着艰辛，所以发音要卷起舌头，比其他元音费劲一些。\n与ろ(ro)音节很像，但ro的发音较明朗，张开嘴巴呈O型，所以下面没有卷起","hotaru","ほたる","蛍","萤火虫"],
                   "re1":["れ","礼","和“礼”字发音和字形都很像。\ngakki日剧《求婚大作战》里的名字就叫“礼(れ)”。","rekishi","れきし","歴史","历史"],
                   "ro1":["ろ","咯","“咯咯咯咯咯咯咯~~~”\n“rororororororo”","yoroshiku","","よろしく","请多关照！拜托了！"],

                    "wa1":["わ","挖","わ字是头朝向右边正在工作的挖掘机！","yubiwa","ゆびわ","指輪","戒指"], 
                   "wo1":["を","我","字形和“我”字相近。\n虽然罗马音是wo，实际上和お一样都发作“o”。常作介词使用。","zamaomiro","ざまをみろ","ざまを見ろ","活该"],
                   "n1":["ん","n","ん是一个长高的字母n，发作鼻音n。","mikan","みかん","蜜柑","蜜柑"],
                   "n2":["ン","冷","“嗯(鼻音)————今天好冷啊。”","","kanningu","カンニング","作弊"],
    
                   "ga1":["が","","","tegami","てがみ","手紙","信纸"], 
                   "gi1":["ぎ","","","kagi","かぎ","鍵","钥匙"],
                   "gu1":["ぐ","","","guruguru","","ぐるぐる","滚来滚去"],
                   "ge1":["げ","","","genkan","げんかん","玄関","玄关"],
                   "go1":["ご","","","tamago","たまご","卵","蛋"],

                    "za1":["ざ","","","zannen","ざんねん","残念","遗憾"],
                   "ji1":["じ","","","hajimemashite","はじめして","初めまして","初次见面，请多关照"],
                   "zu1":["ず","","","suzuki","すずき","鈴木","(姓氏)"],
                   "ze1":["ぜ","","","kaze","かぜ","風","风"],
                   "zo1":["ぞ","","","kazoku","かぞく","家族","家族，家属，家人"],

                    "da1":["だ","","","tadaima","","ただいま","我回来啦"],
                   "ji31":["ぢ","","","hanadi","はなぢ","鼻血","鼻血"],
                   "zu31":["づ","","","tedukuri","てづくり","手作り","自己做，手工制"],
                   "de1":["で","","","deai","であい","出会い","相遇，相识"],
                   "do1":["ど","","","mado","まど","窓","窗户"],
    
                    "ba1":["ば","","","ikebana","いけばな","生け花","插花"], 
                   "bi1":["び","","","sabishi","さびしい","寂しい","寂寞到撒鼻息（喂"],
                   "bu1":["ぶ","","","daijyoubu","だいじょうぶ","大丈夫","没关系"],
                   "be1":["べ","","","betsuni","べつに","別に","其他的"],
                   "bo1":["ぼ","","","boroboro","","ぼろぼろ","破烂的"],

                    "pa1":["ぱ","","","","","",""], 
                   "pi1":["ぴ","","","","","",""],
                   "pu1":["ぷ","","","tenpura","てんぷら","天ぷら","天妇罗"],
                   "pe1":["ぺ","","","pekopeko","","ぺこぺこ","肚子饿"],
                   "po1":["ぽ","","","poi","","...ぽい","……的样子"],
    
                   "kya1":["きゃ","","","kyaku","きゃく","客","客人"], 
                   "kyu1":["きゅ","","","kyuujitsu","きゅうじつ","休日","休息日"],
                   "kyo1":["きょ","","","benkyo","べんきょう","勉強","学习"],
                   "gya1":["ぎゃ","","","gyakuni","ぎゃくに","逆に","相反地"],
                   "gyu1":["ぎゅ","","","gyuunyu","ぎゅうにゅう","牛乳","牛奶"],
                   "gyo1":["ぎょ","","","sakugyou","さくぎょう","作業","工作，操作，劳动"],
                                                
                
                    "sha1":["しゃ","","","kaisha","かいしゃ","会社","公司"],
                   "shu1":["しゅ","","","shumi","しゅみ","趣味","趣味，爱好，风趣"],
                   "sho1":["しょ","","","shourai","しょうらい","将来",""],
                   "ja1":["じゃ","","","jaane","","じゃあね","再见啦"],
                   "ju1":["じゅ","","","jyuunen","じゅうねん","十年",""],
                   "jo1":["じょ","","","kanojo","かのじょ","彼女","她；女朋友"],
                
                    "cha1":["ちゃ","","","chawan","ちゃわん","茶碗","碗，茶杯，饭碗"],
                   "chu1":["ちゅ","","","","","",""],
                   "cho1":["ちょ","","","","","",""],
                
                    "nya1":["にゃ","","","","","",""], 
                   "nyu1":["にゅ","","","gyuunyu","ぎゅうにゅう","牛肉",""],
                   "nyo1":["にょ","","","nyojitsu","にょうじつ","如実","真实，如实"],
                    "hya1":["ひゃ","","","hyaku","ひゃく","百",""], 
                   "hyu1":["ひゅ","","","hyuugashi","ひゅうがし","日向市","（日本的一个城市）"],
                   "hyo1":["ひょ","","","hyoujyun","ひょうじゅん","標準","标准"],
                   "bya1":["びゃ","","","","","",""],
                   "byu1":["びゅ","","","","","",""],
                   "byo1":["びょ","","","byouin","びょういん","病院","医院"],
                   "pya1":["ぴゃ","","","","","",""],
                   "pyu1":["ぴゅ","","","","","",""],
                   "pyo1":["ぴょ","","","","","",""],
                
                    "mya1":["みゃ","","","myaku","みゃく","脈","脉，血管"], 
                   "myu1":["みゅ","","","","","",""],
                   "myo1":["みょ","","","","","",""],
                    "rya1":["りゃ","","","syouryaku","しょうらい","省略",""], 
                   "ryu1":["りゅ","","","ryuukou","りゅうこう","流行",""],
                   "ryo1":["りょ","","","ryokou","りょこう","旅行",""],
    

                    "a2":["ア","阿","取自阿字的左部，非常好记。","","anime","アニメ","动漫"],
                    "i2":["イ","伊","所谓伊人，在水一方。","","ikemen","イケメン","帅哥"],
                   "u2":["ウ","乌","“乌”字的上部就是ウ啦。","","uirusu","ウイルス","病毒"],
                   "e2":["エ","诶","和平假名え一样，都可以联想“诶”字记忆。\n如果你见过“工口”这个网络词汇，它实际上不读gong'kou，而是日语读音‘e’ro’，具体意思……搜索一下→_→","","eakon","エアコン","空调"],
                   "o2":["オ","我","“我，是一个非常有才的人！”\n“…………………………哦。”","","otaku","オタク","御宅族"],

                   "ka2":["カ","加","和平假名几乎长得一样~","","kamera","カメラ","照相机"], 
                   "ki2":["キ","起","“起”字的头部！","","kisu","キス","吻"],
                   "ku2":["ク","哭","从“哭”字的左下部取下，就是ク啦。","","kurasu","クラス","班级，分类"],
                   "ke2":["ケ","K","字母K的脚扭了……\n快扶起他去医院……","","basuke","バスケ","篮球"],
                   "ko2":["コ","口","张开了的口，就是コ。","","kotsu","コツ","秘诀，窍门"],

                    "sa2":["サ","艹","风吹过，草地一片“沙——沙——”声。","","sain","サイン","签名"],
                   "shi2":["シ","洗","“洗”字的左部。\n“阿姨洗铁路”的音译里的“洗”对应的就是シ。","","shiruku","シルク","丝绸"],
                   "su2":["ス","须","源于“须”字的草书，取自右上部分。","","aisu","アイス","冰块"],
                   "se2":["セ","世","和平假名せ长得很像，也源于“世界”的“世”。","","serifu","セリフ","台词"],
                   "so2":["ソ","说","可以看成是“说”字右上角的两点。","","soro","ソロ","独奏"],

                    "ta2":["タ","多","“多”字的一半，发音很相近。","","taipu","タイプ","类型"],
                   "chi2":["チ","千","源于汉字“千”。\nチ是一个美好的音节，因为读它的时候，一定会，“チ——”地咧开嘴微笑起来~","","kimuchi","キムチ","泡菜"],
                   "tsu2":["ツ","川","四川有很多好初（ツ）的东西！","","doitsu","ドイツ","德国"],
                   "te2":["テ","天","天字去掉一捺，就是テ啦。\n“欧我的テン啊！！”","","motemote","モテモテ","受欢迎的"],
                   "to2":["ト","下","小明拿着小树枝「ト」用力捅着沙土，想找出童年埋起来的百宝盒。","","tomato","トマト","番茄"],

                    "na2":["ナ","奈","奈字的左上角，最初的两笔，就是ナ啦。","","banana","バナナ","香蕉"], 
                   "ni2":["ニ","二","和“一二三四”的二长得一样，ni也是日语里数字2的发音。","","tenisu","テニス","网球"],
                   "nu2":["ヌ","奴","“奴”字的右部","","enu","エヌ","北，名词"],
                   "ne2":["ネ","衣","捏（ネ）！\n你衣服上的领带（ネクタイ）歪了！","","nekutai","ネクタイ","领带"],
                   "no2":["ノ","|","本来站得笔直的“|”被挪走了！！\n用力过猛变成了「ノ」！！","","piano","ピアノ","钢琴"],
                                
                    "ha2":["ハ","哈","哈哈哈哈我中了八百万！！！\n嗯？？嗯天亮了…………","","hawai","ハワイ","夏威夷"], 
                   "hi2":["ヒ","ヒ","ヒ是一个面朝右侧，笑得几乎人仰马翻的小人（喂不要乱用词）\n“嘻哈哈哈哈哈哈哈嘻嘻嘻嘻嘻————”","","hiroin","ヒロイン","女英雄"],
                   "fu2":["フ","福","「原来我已经，有福气♬」\n取“福”字的第二笔即可。","","naifu","ナイフ","刀子"],
                   "he2":["ヘ","","","","heasutairu","ヘアスタイル","发型"],
                   "ho2":["ホ","禾","锄「ホ」日当午，汗滴禾下土。","","hosuto","ホスト","男公关"],

                    "ma2":["マ","马","马字的上部就是マ。","","kurisumasu","クリスマス","圣诞节"],
                   "mi2":["ミ","美","取“美”字四笔里的三笔。\n《夏目友人帐》里的猫咪先生变身后脸上就有三道红线呢！喵咪咪咪咪！","","misu","ミス","错误"],
                   "mu2":["ム","么","和“么”字音形都很相像~","","arubamu","アルバム","相册"],
                   "me2":["メ","没","没了！メ了！没了！メ了！\n（冷静）嗯可以看成是“没”字拆剩下最后的两笔「メ」","","medori","メロヂ","旋律"],
                   "mo2":["モ","毛","和毛字非常相似。\n在日语里もも是桃子的意思，桃子的表面有一层小绒毛，超级可爱w，所以叫もも噢（开始胡说八道）","","memo","メモ","便利贴"],
  
                    "ya2":["ヤ","丫","远处响起了“ya!——————”的叫声，原来是拿着“丫”形弹弓的小男孩的恶作剧！","","iyaringu","イヤリング","耳环"],
                   "yu2":["ユ","由","“由”字的右侧就是「ユ」","","yuri","ユリ","百合花"],
                   "yo2":["ヨ","与","取“与”字的下部，发音非常相似。","","yoga","ヨガ","瑜伽"],

                    "ra2":["ラ","良","“良”字的第一二笔就是「ラ」","","raibu","ライブ","直播，演唱会"], 
                   "ri2":["リ","利","利的右边，所以也读ri！","","ribon","リボン","丝带，缎带，飘带"],
                   "ru2":["ル","流","源于“流”字，取右下角，溪水流动，发出“lululu”的声音。","","riaru","リアル","真实的"],
                   "re2":["レ","礼","“礼”字的右部，就是レ。","","remon","レモン","柠檬"],
                   "ro2":["ロ","咯","咯咯咯咯咯咯咯咯~~~\n（严肃）嗯取“咯”字的下部分","","burogu","ブログ","部落格，博客"],

                    "wa2":["ワ","ワ","ワ像一个小铲子，右手举起ワ，轻轻挖起一些土，向上一弯，土就挖起来啦，再也不用担心这个月的粮食啦（喂）","","wain","ワイン","酒"], 
                   "wo2":["ヲ","窝","我觉得，ヲ长得很像大熊猫爱吃的窝窝头…………\n真的（严肃）","","","",""],
    
           
    
                   "ga2":["ガ","","","","","",""], 
                   "gi2":["ギ","","","","","",""],
                   "gu2":["グ","","","","","",""],
                   "ge2":["ゲ","","","","","",""],
                   "go2":["ゴ","","","","","",""],

                    "za2":["ザ","","","","","",""],
                   "ji2":["ジ","","","","","",""],
                   "zu2":["ズ","","","","","",""],
                   "ze2":["ゼ","","","","","",""],
                   "zo2":["ゾ","","","","","",""],

                    "da2":["ダ","","","","","",""],
                   "ji32":["ヂ","","","","","",""],
                   "zu32":["ヅ","","","","","",""],
                   "de2":["デ","","","","","",""],
                   "do2":["ド","","","","","",""],
    
                    "ba2":["バ","","","","","",""], 
                   "bi2":["ビ","","","","","",""],
                   "bu2":["ブ","","","","","",""],
                   "be2":["ベ","","","","","",""],
                   "bo2":["ボ","","","","","",""],

                    "pa2":["パ","","","","","",""], 
                   "pi2":["ピ","","","","","",""],
                   "pu2":["プ","","","","","",""],
                   "pe2":["ペ","","","","","",""],
                   "po2":["ポ","","","","","",""],
 
    
    
    
                   "kya2":["キャ","","","","","",""], 
                   "kyu2":["キュ","","","","","",""],
                   "kyo2":["キョ","","","","","",""],
                   "gya2":["ギャ","","","","","",""],
                   "gyu2":["ギュ","","","","","",""],
                   "gyo2":["ギョ","","","","","",""],
                                                
                
                    "sha2":["シャ","","","","","",""],
                   "shu2":["シュ","","","","","",""],
                   "sho2":["ショ","","","","","",""],
                   "ja2":["ジャ","","","","","",""],
                   "ju2":["ジュ","","","","","",""],
                   "jo2":["ジョ","","","","","",""],

                    "cha2":["チャ","","","","","",""],
                   "chu2":["チュ","","","","","",""],
                   "cho2":["チョ","","","","","",""],
                
                
                    "nya2":["ニャ","","","","","",""], 
                   "nyu2":["ニュ","","","","","",""],
                   "nyo2":["ニョ","","","","","",""],
                    "hya2":["ヒャ","","","","","",""], 
                   "hyu2":["ヒュ","","","","","",""],
                   "hyo2":["ヒョ","","","","","",""],
                   "bya2":["ビャ","","","","","",""],
                   "byu2":["ビュ","","","","","",""],
                   "byo2":["ビョ","","","","","",""],
                   "pya2":["ピャ","","","","","",""],
                   "pyu2":["ピュ","","","","","",""],
                   "pyo2":["ピョ","","","","","",""],
                
                
                   "mya2":["ミャ","","","","","",""], 
                   "myu2":["ミュ","","","","","",""],
                   "myo2":["ミョ","","","","","",""],
                   "rya2":["リャ","","","","","",""], 
                   "ryu2":["リュ","","","","","",""],
                   "ryo2":["リョ","","","","","",""],
                   
}
    
var gif_show = document.getElementsByClassName("note_title")[0];
var note_main = document.getElementById('note_main');
var spell = document.getElementById('spell');
var note_aside = document.getElementById('note_aside');
var idea = document.getElementById('idea');
var idea_detail = document.getElementById('idea_detail');
var hide_spell = document.getElementById("hide_spell");
var shown_spell = document.getElementById('shown_spell');
var word = document.getElementById('word');
var word_detail = document.getElementById('word_detail');
var order = document.getElementById("order");//笔顺
var backchar = document.getElementById('backchar');
var info = document.getElementById('info');
var tds = document.getElementsByTagName('h6');

//右侧选择板块
var value1 = "清<br>音";//0,1,2 清音浊音拗音
var value2 = "平<br>假<br>名";//0,1 平假名，片假名
var select1 = document.getElementsByClassName('select1')[0];
var select2 = document.getElementsByClassName('select2')[0];
var tables = document.getElementsByClassName('table');



//控制笔顺图的浮现
gif_show.onmousemove = function(){
    order.style.opacity = "1";
}

gif_show.onmouseout = function(){
    order.style.opacity = "0";
}

select1.onclick = function(e) {
    select(e.target,1);
}

select2.onclick = function(e) {
    select(e.target,2);
}


for(var i=0,len = tds.length;i<len;i++) {
    tds[i].onclick = function(e){
        show(e.target);
    }
}

function show(target) {
        var speak = target.innerHTML;
        if(value2 =="平<br>假<br>名") {
            var select='1';
            var not_select ='2';
        } else {
            var select ='2';
            var not_select ='1';
        }

        var arr = data[speak+select];
        note_main.innerHTML = arr[0];
        spell.innerHTML = speak;
        note_aside.innerHTML = data[speak+not_select][0];
        idea.innerHTML = arr[1];
        idea_detail.innerHTML = arr[2];
        hide_spell.innerHTML = arr[3];
        shown_spell.innerHTML = arr[4];
        word.innerHTML = arr[5];
        word_detail.innerHTML = arr[6];
        backchar.innerHTML = arr[0];
        order.innerHTML = '<img src="gif/'+speak+select+'.gif">';
        var gif = document.getElementsByTagName('img')[0];
        if(value1 =="清<br>音"){
                gif.className+="show";
            } else {
                gif.className="hide";
            }
}

function getTable() {
    var v1 = value1.replace("清<br>音","qing_");
    v1 = v1.replace("浊<br>音","zhuo_");
    v1 = v1.replace('拗<br>音',"ao_");
    var v2 = value2.replace("平<br>假<br>名","soft");
    v2 = v2.replace('片<br>假<br>名',"hard");
    for(var i=0,len = tables.length;i<len;i++) {
        tables[i].className +=' hide';
    }
    document.getElementById(v1+v2).className="table";
}

function select(target,value) {
    var children = target.parentNode.getElementsByTagName('div');
    for(var i=0,len = children.length;i<len;i++){
            if(children[i].className.indexOf('selected')!= -1) {
               children[i].className ="";
            }
    }
    target.className += "selected";
    if(value==1) {
        value1 = target.innerHTML;
    } else{
        value2 = target.innerHTML;
    }
    var text = "<span>"+value1+"</span><br><br><span>"+value2+"</span>";
    info.innerHTML = text;
    getTable();
}


