
var data = {
                    "a1":["あ","","","aishiteru","あいしてる","愛してる","我爱你"],
                    "i1":["い","","","aitai","あいたい","会いたい","想见你"],
                   "u1":["う","","","ume","うめ","梅","梅子"],
                   "e1":["え","","","emoji","えもじ","絵文字","颜文字"],
                   "o1":["お","","","oishii","おいしい","美味しい","好吃！好吃好吃！"],

                   "ka1":["か","","","kawaii","かわいい","可愛い","可爱！"], 
                   "ki1":["き","","","tenki","てんき","天気","天气"],
                   "ku1":["く","","","kuma","","くま","熊(轻松熊叫Rillakuma哦！)"],
                   "ke1":["け","","","kega","けが","怪我","受伤"],
                   "ko1":["こ","","","kokoro","こころ","心","❤️"],

                    "sa1":["さ","","","sakura","さくら","桜","樱花"],
                   "shi1":["し","","","sushi","すし","寿司",""],
                   "su1":["す","","","suki","すき","好き","喜欢"],
                   "se1":["せ","","","sekai","せかい","世界","世界"],
                   "so1":["そ","","","uso","うそ","嘘","谎言，说谎"],

                    "ta1":["た","","","tatami","たたみ","畳","榻榻米就来源于这个词哦"],
                   "chi1":["ち","","","konnichiha","こんにちは","今日は","(白天见面)你好"],
                   "tsu1":["つ","","","himitsu","ひみつ","秘密",""],
                   "te1":["て","","","tenshi","てんし","天使",""],
                   "to1":["と","","","tomodachi","ともだち","友達","朋友"],

                    "na1":["な","","","natsu","なつ","夏","夏天"], 
                   "ni1":["に","","","nihon","にほん","日本","日本"],
                   "nu1":["ぬ","","","inu","","いぬ","狗狗"],
                   "ne1":["ね","","","neko","","ねこ","猫猫"],
                   "no1":["の","","","inochi","いのち","命","性命"],
                                
                   "ha1":["は","","","haru","はる","春","春天"], 
                   "hi1":["ひ","","","himawari","","ひまわり","向日葵"],
                   "fu1":["ふ","","","fuyu","ゆり","冬","冬天"],
                   "he1":["へ","","","heya","へや","部屋","房间，屋子"],
                   "ho1":["ほ","","","hoshi","ほし","星","(新海诚有一部追逐繁星的孩子哦)"],

                    "ma1":["ま","","","majide","","まじで","真的吗？"],
                   "mi1":["み","","","mimi","みみ","耳","耳朵"],
                   "mu1":["む","","","muri","むり","無理","不行，不可能"],
                   "me1":["め","","","ame","あめ","雨",""],
                   "mo1":["も","","","momo","もも","桃",""],
  
                    "ya1":["や","","","yasumi","やすみ","休み","休息"],
                   "yu1":["ゆ","","","yuki","ゆき","雪",""],
                   "yo1":["よ","","","hanayome","はなよめ","花嫁","新娘"],

                    "ra1":["ら","","","rakugaki","らくがき","落書き","涂鸦"], 
                   "ri1":["り","","","ringo","","りんご","苹果"],
                   "ru1":["る","","","hotaru","ほたる","蛍","萤火虫"],
                   "re1":["れ","","","rekishi","れきし","歴史","历史"],
                   "ro1":["ろ","","","yoroshiku","","よろしく","请多关照！拜托了！"],

                    "wa1":["わ","","","yubiwa","ゆびわ","指輪","戒指"], 
                   "wo1":["を","","","zamaomiro","ざまをみろ","ざまを見ろ","活该"],
                   "n1":["ん","","","mikan","みかん","蜜柑","蜜柑"],
                   "n2":["ン","","","","kanningu","カンニング","作弊"],
    
                   "ga1":["が","","","tegami","てがみ","手紙","信纸"], 
                   "gi1":["ぎ","","","kagi","かぎ","鍵","钥匙"],
                   "gu1":["ぐ","","","guruguru","","ぐるぐる","滚来滚去"],
                   "ge1":["げ","","","genkan","げんかん","玄関","玄关"],
                   "go1":["ご","","","tamago","たまご","卵","蛋"],

                    "za1":["ざ","","","zannen","ざんねん","残念","遗憾"],
                   "ji1":["じ","","","hajimemashite","はじめして","初めまして","初次见面，请多关照"],
                   "zu1":["ず","","","suzuki","すずき","鈴木","(姓氏)"],
                   "ze1":["ぜ","","","kaze","かぜ","風","风"],
                   "zo1":["ぞ","","","kazoku","かぞく","家族","家族，家属，家人"],

                    "da1":["だ","","","tadaima","","ただいま","我回来啦"],
                   "ji31":["ぢ","","","hanadi","はなぢ","鼻血","鼻血"],
                   "zu31":["づ","","","tedukuri","てづくり","手作り","自己做，手工制"],
                   "de1":["で","","","deai","であい","出会い","相遇，相识"],
                   "do1":["ど","","","mado","まど","窓","窗户"],
    
                    "ba1":["ば","","","ikebana","いけばな","生け花","插花"], 
                   "bi1":["び","","","sabishi","さびしい","寂しい","寂寞到撒鼻息（喂"],
                   "bu1":["ぶ","","","daijyoubu","だいじょうぶ","大丈夫","没关系"],
                   "be1":["べ","","","betsuni","べつに","別に","其他的"],
                   "bo1":["ぼ","","","boroboro","","ぼろぼろ","破烂的"],

                    "pa1":["ぱ","","","","","",""], 
                   "pi1":["ぴ","","","","","",""],
                   "pu1":["ぷ","","","tenpura","てんぷら","天ぷら","天妇罗"],
                   "pe1":["ぺ","","","pekopeko","","ぺこぺこ","肚子饿"],
                   "po1":["ぽ","","","poi","","...ぽい","……的样子"],
 
    
    
    
                   "kya1":["きゃ","","","kyaku","きゃく","客","客人"], 
                   "kyu1":["きゅ","","","kyuujitsu","きゅうじつ","休日","休息日"],
                   "kyo1":["きょ","","","benkyo","べんきょう","勉強","学习"],
                   "gya1":["ぎゃ","","","gyakuni","ぎゃくに","逆に","相反地"],
                   "gyu1":["ぎゅ","","","gyuunyu","ぎゅうにゅう","牛乳","牛奶"],
                   "gyo1":["ぎょ","","","sakugyou","さくぎょう","作業","工作，操作，劳动"],
                                                
                
                    "sha1":["しゃ","","","kaisha","かいしゃ","会社","公司"],
                   "shu1":["しゅ","","","shumi","しゅみ","趣味","趣味，爱好，风趣"],
                   "sho1":["しょ","","","shourai","しょうらい","将来",""],
                   "ja1":["じゃ","","","jaane","","じゃあね","再见啦"],
                   "ju1":["じゅ","","","jyuunen","じゅうねん","十年",""],
                   "jo1":["じょ","","","kanojo","かのじょ","彼女","她；女朋友"],
                
                                
                
                    "cha1":["ちゃ","","","chawan","ちゃわん","茶碗","碗，茶杯，饭碗"],
                   "chu1":["ちゅ","","","","","",""],
                   "cho1":["ちょ","","","","","",""],
                
                
                    "nya1":["にゃ","","","","","",""], 
                   "nyu1":["にゅ","","","gyuunyu","ぎゅうにゅう","牛肉",""],
                   "nyo1":["にょ","","","nyojitsu","にょうじつ","如実","真实，如实"],
                    "hya1":["ひゃ","","","hyaku","ひゃく","百",""], 
                   "hyu1":["ひゅ","","","hyuugashi","ひゅうがし","日向市","（日本的一个城市）"],
                   "hyo1":["ひょ","","","hyoujyun","ひょうじゅん","標準","标准"],
                   "bya1":["びゃ","","","","","",""],
                   "byu1":["びゅ","","","","","",""],
                   "byo1":["びょ","","","byouin","びょういん","病院","医院"],
                   "pya1":["ぴゃ","","","","","",""],
                   "pyu1":["ぴゅ","","","","","",""],
                   "pyo1":["ぴょ","","","","","",""],
                
                
                    "mya1":["みゃ","","","myaku","みゃく","脈","脉，血管"], 
                   "myu1":["みゅ","","","","","",""],
                   "myo1":["みょ","","","","","",""],
                    "rya1":["りゃ","","","syouryaku","しょうらい","省略",""], 
                   "ryu1":["りゅ","","","ryuukou","りゅうこう","流行",""],
                   "ryo1":["りょ","","","ryokou","りょこう","旅行",""],
    
    
    
    
    
                    "a2":["ア","","","anime","アニメ","动漫"],
                    "i2":["イ","","","ikemen","イケメン","帅哥"],
                   "u2":["ウ","","","uirusu","ウイルス","病毒"],
                   "e2":["エ","","","eakon","エアコン","空调"],
                   "o2":["オ","","","otaku","オタク","御宅族"],

                   "ka2":["カ","","","kamera","カメラ","照相机"], 
                   "ki2":["キ","","","kisu","キス","吻"],
                   "ku2":["ク","","","kurasu","クラス","班级，分类"],
                   "ke2":["ケ","","","basuke","バスケ","篮球"],
                   "ko2":["コ","","","kotsu","コツ","秘诀，窍门"],

                    "sa2":["サ","","","sain","サイン","签名"],
                   "shi2":["シ","","","shiruku","シルク","丝绸"],
                   "su2":["ス","","","aisu","アイス","冰块"],
                   "se2":["セ","","","serifu","セリフ","台词"],
                   "so2":["ソ","","","soro","ソロ","独奏"],

                    "ta2":["タ","","","taipu","タイプ","类型"],
                   "chi2":["チ","","","kimuchi","キムチ","泡菜"],
                   "tsu2":["ツ","","","doitsu","ドイツ","德国"],
                   "te2":["テ","","","motemote","モテモテ","受欢迎的"],
                   "to2":["ト","","","tomato","トマト","番茄"],

                    "na2":["ナ","","","banana","バナナ","香蕉"], 
                   "ni2":["ニ","","","tenisu","テニス","网球"],
                   "nu2":["ヌ","","","enu","エヌ","北，名词"],
                   "ne2":["ネ","","","nekutai","ネクタイ","领带"],
                   "no2":["ノ","","","piano","ピアノ","钢琴"],
                                
                    "ha2":["ハ","","","hawai","ハワイ","夏威夷"], 
                   "hi2":["ヒ","","","hiroin","ヒロイン","女英雄"],
                   "fu2":["フ","","","naifu","ナイフ","刀子"],
                   "he2":["ヘ","","","heasutairu","ヘアスタイル","发型"],
                   "ho2":["ホ","","","hosuto","ホスト","男公关"],

                    "ma2":["マ","","","kurisumasu","クリスマス","圣诞节"],
                   "mi2":["ミ","","","misu","ミス","错误"],
                   "mu2":["ム","","","arubamu","アルバム","相册"],
                   "me2":["メ","","","megane","メガネ","眼镜"],
                   "mo2":["モ","","","memo","メモ","便利贴"],
  
                    "ya2":["ヤ","","","iyaringu","イヤリング","耳环"],
                   "yu2":["ユ","","","yuri","ユリ","百合花"],
                   "yo2":["ヨ","","","yoga","ヨガ","瑜伽"],

                    "ra2":["ラ","","","raibu","ライブ","直播，演唱会"], 
                   "ri2":["リ","","","ribon","リボン","丝带，缎带，飘带"],
                   "ru2":["ル","","","riaru","リアル","真实的"],
                   "re2":["レ","","","remon","レモン","柠檬"],
                   "ro2":["ロ","","","burogu","ブログ","部落格，博客"],

                    "wa2":["ワ","","","wain","ワイン","酒"], 
                   "wo2":["ヲ","","","","","",""],
    
           
    
                   "ga2":["ガ","","","","","",""], 
                   "gi2":["ギ","","","","","",""],
                   "gu2":["グ","","","","","",""],
                   "ge2":["ゲ","","","","","",""],
                   "go2":["ゴ","","","","","",""],

                    "za2":["ザ","","","","","",""],
                   "ji2":["ジ","","","","","",""],
                   "zu2":["ズ","","","","","",""],
                   "ze2":["ゼ","","","","","",""],
                   "zo2":["ゾ","","","","","",""],

                    "da2":["ダ","","","","","",""],
                   "ji32":["ヂ","","","","","",""],
                   "zu32":["ヅ","","","","","",""],
                   "de2":["デ","","","","","",""],
                   "do2":["ド","","","","","",""],
    
                    "ba2":["バ","","","","","",""], 
                   "bi2":["ビ","","","","","",""],
                   "bu2":["ブ","","","","","",""],
                   "be2":["ベ","","","","","",""],
                   "bo2":["ボ","","","","","",""],

                    "pa2":["パ","","","","","",""], 
                   "pi2":["ピ","","","","","",""],
                   "pu2":["プ","","","","","",""],
                   "pe2":["ペ","","","","","",""],
                   "po2":["ポ","","","","","",""],
 
    
    
    
                   "kya2":["キャ","","","","","",""], 
                   "kyu2":["キュ","","","","","",""],
                   "kyo2":["キョ","","","","","",""],
                   "gya2":["ギャ","","","","","",""],
                   "gyu2":["ギュ","","","","","",""],
                   "gyo2":["ギョ","","","","","",""],
                                                
                
                    "sha2":["シャ","","","","","",""],
                   "shu2":["シュ","","","","","",""],
                   "sho2":["ショ","","","","","",""],
                   "ja2":["ジャ","","","","","",""],
                   "ju2":["ジュ","","","","","",""],
                   "jo2":["ジョ","","","","","",""],
                
                                
                
                    "cha2":["チャ","","","","","",""],
                   "chu2":["チュ","","","","","",""],
                   "cho2":["チョ","","","","","",""],
                
                
                    "nya2":["ニャ","","","","","",""], 
                   "nyu2":["ニュ","","","","","",""],
                   "nyo2":["ニョ","","","","","",""],
                    "hya2":["ヒャ","","","","","",""], 
                   "hyu2":["ヒュ","","","","","",""],
                   "hyo2":["ヒョ","","","","","",""],
                   "bya2":["ビャ","","","","","",""],
                   "byu2":["ビュ","","","","","",""],
                   "byo2":["ビョ","","","","","",""],
                   "pya2":["ピャ","","","","","",""],
                   "pyu2":["ピュ","","","","","",""],
                   "pyo2":["ピョ","","","","","",""],
                
                
                   "mya2":["ミャ","","","","","",""], 
                   "myu2":["ミュ","","","","","",""],
                   "myo2":["ミョ","","","","","",""],
                   "rya2":["リャ","","","","","",""], 
                   "ryu2":["リュ","","","","","",""],
                   "ryo2":["リョ","","","","","",""],
                   
}
    
var note_main = document.getElementsByClassName("note_title")[0];
 
note_main.onmousemove = function(){
    document.getElementById('order').style.opacity = "1";
}

note_main.onmouseout = function(){
    document.getElementById("order").style.opacity = "0";
}
